# 1 Задание
num = int(input("Введите целое число: "))

if num % 2 == 0:
    print(f"{num} - четное число.")
else:
    print(f"{num} - нечетное число.")

if num % 5 == 0:
    print(f"{num} - кратно 5.")
else:
    print(f"{num} - не кратно 5.")
